Mask2FormerClassifier(
  (embeddings): SwinEmbeddings(
    (patch_embeddings): SwinPatchEmbeddings(
      (projection): Conv2d(3, 192, kernel_size=(4, 4), stride=(4, 4))
    )
    (norm): LayerNorm((192,), eps=1e-05, elementwise_affine=True)
    (dropout): Dropout(p=0.0, inplace=False)
  )
  (encoder): SwinEncoder(
    (layers): ModuleList(
      (0): SwinStage(
        (blocks): ModuleList(
          (0-1): 2 x SwinLayer(
            (layernorm_before): LayerNorm((192,), eps=1e-05, elementwise_affine=True)
            (attention): SwinAttention(
              (self): SwinSelfAttention(
                (query): Linear(in_features=192, out_features=192, bias=True)
                (key): Linear(in_features=192, out_features=192, bias=True)
                (value): Linear(in_features=192, out_features=192, bias=True)
                (dropout): Dropout(p=0.0, inplace=False)
              )
              (output): SwinSelfOutput(
                (dense): Linear(in_features=192, out_features=192, bias=True)
                (dropout): Dropout(p=0.0, inplace=False)
              )
            )
            (drop_path): SwinDropPath(p=0.3)
            (layernorm_after): LayerNorm((192,), eps=1e-05, elementwise_affine=True)
            (intermediate): SwinIntermediate(
              (dense): Linear(in_features=192, out_features=768, bias=True)
              (intermediate_act_fn): GELUActivation()
            )
            (output): SwinOutput(
              (dense): Linear(in_features=768, out_features=192, bias=True)
              (dropout): Dropout(p=0.0, inplace=False)
            )
          )
        )
        (downsample): SwinPatchMerging(
          (reduction): Linear(in_features=768, out_features=384, bias=False)
          (norm): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
        )
      )
      (1): SwinStage(
        (blocks): ModuleList(
          (0-1): 2 x SwinLayer(
            (layernorm_before): LayerNorm((384,), eps=1e-05, elementwise_affine=True)
            (attention): SwinAttention(
              (self): SwinSelfAttention(
                (query): Linear(in_features=384, out_features=384, bias=True)
                (key): Linear(in_features=384, out_features=384, bias=True)
                (value): Linear(in_features=384, out_features=384, bias=True)
                (dropout): Dropout(p=0.0, inplace=False)
              )
              (output): SwinSelfOutput(
                (dense): Linear(in_features=384, out_features=384, bias=True)
                (dropout): Dropout(p=0.0, inplace=False)
              )
            )
            (drop_path): SwinDropPath(p=0.3)
            (layernorm_after): LayerNorm((384,), eps=1e-05, elementwise_affine=True)
            (intermediate): SwinIntermediate(
              (dense): Linear(in_features=384, out_features=1536, bias=True)
              (intermediate_act_fn): GELUActivation()
            )
            (output): SwinOutput(
              (dense): Linear(in_features=1536, out_features=384, bias=True)
              (dropout): Dropout(p=0.0, inplace=False)
            )
          )
        )
        (downsample): SwinPatchMerging(
          (reduction): Linear(in_features=1536, out_features=768, bias=False)
          (norm): LayerNorm((1536,), eps=1e-05, elementwise_affine=True)
        )
      )
      (2): SwinStage(
        (blocks): ModuleList(
          (0-17): 18 x SwinLayer(
            (layernorm_before): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
            (attention): SwinAttention(
              (self): SwinSelfAttention(
                (query): Linear(in_features=768, out_features=768, bias=True)
                (key): Linear(in_features=768, out_features=768, bias=True)
                (value): Linear(in_features=768, out_features=768, bias=True)
                (dropout): Dropout(p=0.0, inplace=False)
              )
              (output): SwinSelfOutput(
                (dense): Linear(in_features=768, out_features=768, bias=True)
                (dropout): Dropout(p=0.0, inplace=False)
              )
            )
            (drop_path): SwinDropPath(p=0.3)
            (layernorm_after): LayerNorm((768,), eps=1e-05, elementwise_affine=True)
            (intermediate): SwinIntermediate(
              (dense): Linear(in_features=768, out_features=3072, bias=True)
              (intermediate_act_fn): GELUActivation()
            )
            (output): SwinOutput(
              (dense): Linear(in_features=3072, out_features=768, bias=True)
              (dropout): Dropout(p=0.0, inplace=False)
            )
          )
        )
        (downsample): SwinPatchMerging(
          (reduction): Linear(in_features=3072, out_features=1536, bias=False)
          (norm): LayerNorm((3072,), eps=1e-05, elementwise_affine=True)
        )
      )
      (3): SwinStage(
        (blocks): ModuleList(
          (0-1): 2 x SwinLayer(
            (layernorm_before): LayerNorm((1536,), eps=1e-05, elementwise_affine=True)
            (attention): SwinAttention(
              (self): SwinSelfAttention(
                (query): Linear(in_features=1536, out_features=1536, bias=True)
                (key): Linear(in_features=1536, out_features=1536, bias=True)
                (value): Linear(in_features=1536, out_features=1536, bias=True)
                (dropout): Dropout(p=0.0, inplace=False)
              )
              (output): SwinSelfOutput(
                (dense): Linear(in_features=1536, out_features=1536, bias=True)
                (dropout): Dropout(p=0.0, inplace=False)
              )
            )
            (drop_path): SwinDropPath(p=0.3)
            (layernorm_after): LayerNorm((1536,), eps=1e-05, elementwise_affine=True)
            (intermediate): SwinIntermediate(
              (dense): Linear(in_features=1536, out_features=6144, bias=True)
              (intermediate_act_fn): GELUActivation()
            )
            (output): SwinOutput(
              (dense): Linear(in_features=6144, out_features=1536, bias=True)
              (dropout): Dropout(p=0.0, inplace=False)
            )
          )
        )
      )
    )
  )
  (layernorm): LayerNorm((1536,), eps=1e-05, elementwise_affine=True)
  (pooler): AdaptiveAvgPool1d(output_size=1)
  (fc): Sequential(
    (0): Flatten(start_dim=1, end_dim=-1)
    (1): Linear(in_features=1536, out_features=512, bias=True)
    (2): Dropout(p=0.2, inplace=False)
    (3): SiLU()
    (4): Linear(in_features=512, out_features=14, bias=True)
  )
)