MyCNNClassifier(
  (conv_layers): Sequential(
    (0): Conv2d(3, 64, kernel_size=(4, 4), stride=(4, 4))
    (1): SiLU()
    (2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (3): AvgPool2d(kernel_size=4, stride=4, padding=0)
    (4): Conv2d(64, 128, kernel_size=(4, 4), stride=(2, 2))
    (5): SiLU()
    (6): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (7): AvgPool2d(kernel_size=3, stride=2, padding=0)
  )
  (linear_layers): Sequential(
    (0): Flatten(start_dim=1, end_dim=-1)
    (1): Linear(in_features=512, out_features=128, bias=True)
    (2): Dropout(p=0.2, inplace=False)
    (3): SiLU()
    (4): Linear(in_features=128, out_features=14, bias=True)
  )
)