MyCNNClassifier(
  (conv_layers): Sequential(
    (0): Conv2d(3, 64, kernel_size=(4, 4), stride=(2, 2))
    (1): SiLU()
    (2): BatchNorm2d(64, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (3): AvgPool2d(kernel_size=3, stride=2, padding=1)
    (4): Conv2d(64, 128, kernel_size=(4, 4), stride=(2, 2))
    (5): SiLU()
    (6): BatchNorm2d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (7): AvgPool2d(kernel_size=3, stride=2, padding=0)
    (8): Conv2d(128, 256, kernel_size=(4, 4), stride=(3, 3))
    (9): SiLU()
    (10): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (11): AvgPool2d(kernel_size=2, stride=2, padding=0)
  )
  (linear_layers): Sequential(
    (0): Flatten(start_dim=1, end_dim=-1)
    (1): Linear(in_features=1024, out_features=256, bias=True)
    (2): SiLU()
    (3): Linear(in_features=256, out_features=14, bias=True)
  )
)