MyCNNClassifier(
  (conv_layers): Sequential(
    (0): Conv2d(3, 256, kernel_size=(4, 4), stride=(4, 4))
    (1): SiLU()
    (2): BatchNorm2d(256, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (3): AvgPool2d(kernel_size=4, stride=4, padding=0)
    (4): Conv2d(256, 512, kernel_size=(4, 4), stride=(4, 4))
    (5): SiLU()
    (6): BatchNorm2d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (7): AvgPool2d(kernel_size=3, stride=3, padding=0)
  )
  (linear_layers): Sequential(
    (0): Flatten(start_dim=1, end_dim=-1)
    (1): Linear(in_features=512, out_features=14, bias=True)
  )
)